# #http://api.weatherapi.com/v1/forecast.json?key=61636f7026c1432ebc355947221907&q=Yekaterinburg&days=4&aqi=no&alerts=no
# #Ye - 1486209
from datetime import datetime
import requests
import locale
import pytz

locale.setlocale(locale.LC_ALL, "ru_RU")


# s_city = "Yekaterinburg"
# city_id = 0
# appid = "61636f7026c1432ebc355947221907"

################################################################################
def time_now_tz(current_tz):
    time_now = int(datetime.now(tz=current_tz).strftime('%H'))
    return time_now


################################################################################


################################################################################
#
# Погода по часам(на 6 часов)
#
################################################################################
def hours_weather():
    s_city = "Yekaterinburg"
    appid = "61636f7026c1432ebc355947221907"
    temp_text_onHours = []
    hours_all = []
    temp_text = ''
    temp_msg = ''
    global weather_codes

    ekb_tz = pytz.timezone('Asia/Yekaterinburg')
    ###########################
    try:
        res = requests.get("https://api.weatherapi.com/v1/forecast.json",
                           params={
                               'key': appid,
                               'q': s_city,
                               'days': '2',
                               'aqi': 'no',
                               'alerts': 'no'
                           })
        data = res.json()
        # print('###################Hello###################')

        for i in data['forecast']['forecastday']:
            for j in i['hour']:
                hour_time = j['time']
                hour_tmp = j['temp_c']
                hour_feeling = j['feelslike_c']
                hour_is_day = j['is_day']
                hour_text = j['condition']['code']
                hour_rainChace = j['chance_of_rain']
                # hour_is_rain = j['will_it_rain']
                # hour_snowChace = j['chance_of_snow']

                ##текст погоды##
                for i in weather_codes:
                    if i['code'] == int(hour_text):
                        hour_text = i[str(hour_is_day)]
                        break
                ################

                hour_time_to_date = datetime.strptime(hour_time, '%Y-%m-%d %H:%M')
                now_utc = pytz.utc.localize(hour_time_to_date)
                ftime_now = datetime.strftime(now_utc, '%H:%M')

                ##массив времен##
                ftime_all = datetime.strftime(now_utc, '%H')
                hours_all.append(int(ftime_all) + 7)
                # print(ftime_all)
                #################

                if hour_rainChace > 0:
                    ##запись текста на вывод в массив##
                    temp_text = f'-------------------{ftime_now}-------------------\n' \
                                f'{hour_tmp}°C, ощущается как {hour_feeling}°C\n' \
                                f'{hour_text}\n' \
                                f'🌧 Вероятность дождя: {hour_rainChace}%\n' \
                                f'-------------------------------------------\n\n'
                    temp_text_onHours.append(temp_text)
                    ###################################
                else:
                    ##запись текста на вывод в массив##
                    temp_text = f'-------------------{ftime_now}-------------------\n' \
                                f'{hour_tmp}°C, ощущается как {hour_feeling}°C\n' \
                                f'{hour_text}\n' \
                                f'-------------------------------------------\n\n'
                    temp_text_onHours.append(temp_text)
                    ###################################

        time_now = time_now_tz(ekb_tz)

        for i in range(time_now, time_now + 7):
            temp_msg += temp_text_onHours[i]

        return temp_msg

    ##############################
    except Exception as e:
        temp_text += 'Ждем ответ от сервера..Видимо что-то не работает('
        print("Ошибка:", e)
        return temp_text
        pass


################################################################################
#
# Погода на неделю(на три дня вперед)
#
################################################################################
def weekday_weather():
    s_city = "Yekaterinburg"
    appid = "61636f7026c1432ebc355947221907"
    global will_it_rain
    temp_onWeek = []
    temp_text = ''
    temp_msg = ''
    try:
        res = requests.get("https://api.weatherapi.com/v1/forecast.json",
                           params={
                               'key': appid,
                               'q': s_city,
                               'days': '7',
                               'aqi': 'no',
                               'alerts': 'no'
                           })
        data = res.json()

        for i in data['forecast']['forecastday']:
            date_epoch_sec = i['date_epoch']
            date_weather_time = datetime.utcfromtimestamp(date_epoch_sec).strftime('%A, %d %B')

            date_max_temp = i['day']['maxtemp_c']
            date_min_temp = i['day']['mintemp_c']
            date_rain_chance = i['day']['daily_chance_of_rain']
            date_is_rain = will_it_rain[i['day']['daily_will_it_rain']]

            ##запись текста на вывод в массив##
            if date_rain_chance > 0:
                temp_text = f'{date_weather_time} {date_is_rain}\n' \
                            f'Вероятность дождя: {date_rain_chance}%\n' \
                            f'Максимальная температура: {date_max_temp}°C\n' \
                            f'Минимальная температура: {date_min_temp}°C\n' \
                            f'-------------------------------------------\n\n\n'
                temp_onWeek.append(temp_text)

            else:
                temp_text = f'{date_weather_time} {date_is_rain}\n' \
                            f'Максимальная температура: {date_max_temp}°C\n' \
                            f'Минимальная температура: {date_min_temp}°C\n' \
                            f'-------------------------------------------\n\n\n'
                temp_onWeek.append(temp_text)
            ###################################

        for i in range(3):
            temp_msg += temp_onWeek[i]

        return temp_msg

    except Exception as e:
        temp_text += 'Ждем ответ от сервера..Видимо что-то не работает('
        print("Exception (find):", e)
        return temp_text
        pass


################################################################################


will_it_rain = [
    "☀ ",  # нет дождя
    "🌧"  # дождь
]

weather_codes = [
    {
        "code": 1000,
        "1": "Солнечно ☀",  # день
        "0": "Ясно 🌔",  # ночь
        "icon": 113
    },
    {
        "code": 1003,
        "1": "Переменная облачность 🌤",
        "0": "Переменная облачность 🌤",
        "icon": 116
    },
    {
        "code": 1006,
        "1": "Облачно ☁",
        "0": "Облачно ☁",
        "icon": 119
    },
    {
        "code": 1009,
        "1": "Пасмурно ☁☁☁",
        "0": "Пасмурно ☁☁☁",
        "icon": 122
    },
    {
        "code": 1030,
        "1": "Дымка",
        "0": "Дымка",
        "icon": 143
    },
    {
        "code": 1063,
        "1": "Местами дождь 🌧",
        "0": "Местами дождь 🌧",
        "icon": 176
    },
    {
        "code": 1066,
        "1": "Местами снег 🌨",
        "0": "Местами снег 🌨",
        "icon": 179
    },
    {
        "code": 1069,
        "1": "Местами дождь со снегом 🌧",
        "0": "Местами дождь со снегом 🌧",
        "icon": 182
    },
    {
        "code": 1072,
        "1": "Местами замерзающая морось 🌧",
        "0": "Местами замерзающая морось 🌧",
        "icon": 185
    },
    {
        "code": 1087,
        "1": "Местами грозы 🌩",
        "0": "Местами грозы 🌩",
        "icon": 200
    },
    {
        "code": 1114,
        "1": "Позёмок",
        "0": "Позёмок",
        "icon": 227
    },
    {
        "code": 1117,
        "1": "Метель 🌪",
        "0": "Метель 🌪",
        "icon": 230
    },
    {
        "code": 1135,
        "1": "Туман 🌫",
        "0": "Туман 🌫",
        "icon": 248
    },
    {
        "code": 1147,
        "1": "Переохлажденный туман",
        "0": "Переохлажденный туман",
        "icon": 260
    },
    {
        "code": 1150,
        "1": "Местами слабая морось 🌦",
        "0": "Местами слабая морось 🌦",
        "icon": 263
    },
    {
        "code": 1153,
        "1": "Слабая морось 🌦",
        "0": "Слабая морось 🌦",
        "icon": 266
    },
    {
        "code": 1168,
        "1": "Замерзающая морось 🌧",
        "0": "Замерзающая морось 🌧",
        "icon": 281
    },
    {
        "code": 1171,
        "1": "Сильная замерзающая морось 🌧🌧🌧",
        "0": "Сильная замерзающая морось 🌧🌧🌧",
        "icon": 284
    },
    {
        "code": 1180,
        "1": "Местами небольшой дождь 🌧",
        "0": "Местами небольшой дождь 🌧",
        "icon": 293
    },
    {
        "code": 1183,
        "1": "Небольшой дождь 🌧",
        "0": "Небольшой дождь 🌧",
        "icon": 296
    },
    {
        "code": 1186,
        "1": "Временами умеренный дождь 🌧",
        "0": "Временами умеренный дождь 🌧",
        "icon": 299
    },
    {
        "code": 1189,
        "1": "Умеренный дождь 🌧🌧",
        "0": "Умеренный дождь 🌧🌧",
        "icon": 302
    },
    {
        "code": 1192,
        "1": "Временами сильный дождь 🌧🌧",
        "0": "Временами сильный дождь 🌧🌧",
        "icon": 305
    },
    {
        "code": 1195,
        "1": "Сильный дождь 🌧🌧🌧",
        "0": "Сильный дождь 🌧🌧🌧",
        "icon": 308
    },
    {
        "code": 1198,
        "1": "Слабый переохлажденный дождь 🌧",
        "0": "Слабый переохлажденный дождь 🌧",
        "icon": 311
    },
    {
        "code": 1201,
        "1": "Умеренный или сильный переохлажденный дождь 🌧🌧",
        "0": "Умеренный или сильный переохлажденный дождь 🌧🌧",
        "icon": 314
    },
    {
        "code": 1204,
        "1": "Небольшой дождь со снегом 🌧",
        "0": "Небольшой дождь со снегом 🌧",
        "icon": 317
    },
    {
        "code": 1207,
        "1": "Умеренный или сильный дождь со снегом 🌧🌨",
        "0": "Умеренный или сильный дождь со снегом 🌧🌨",
        "icon": 320
    },
    {
        "code": 1210,
        "1": "Местами небольшой снег 🌨",
        "0": "Местами небольшой снег 🌨",
        "icon": 323
    },
    {
        "code": 1213,
        "1": "Небольшой снег 🌨",
        "0": "Небольшой снег 🌨",
        "icon": 326
    },
    {
        "code": 1216,
        "1": "Местами умеренный снег 🌨",
        "0": "Местами умеренный снег 🌨",
        "icon": 329
    },
    {
        "code": 1219,
        "1": "Умеренный снег 🌨🌨",
        "0": "Умеренный снег 🌨🌨",
        "icon": 332
    },
    {
        "code": 1222,
        "1": "Местами сильный снег 🌨🌨",
        "0": "Местами сильный снег 🌨🌨",
        "icon": 335
    },
    {
        "code": 1225,
        "1": "Сильный снег 🌨🌨🌨",
        "0": "Сильный снег 🌨🌨🌨",
        "icon": 338
    },
    {
        "code": 1237,
        "1": "Ледяной дождь 🌧",
        "0": "Ледяной дождь 🌧",
        "icon": 350
    },
    {
        "code": 1240,
        "1": "Небольшой ливневый дождь 🌧",
        "0": "Небольшой ливневый дождь 🌧",
        "icon": 353
    },
    {
        "code": 1243,
        "1": "Умеренный или сильный ливневый дождь 🌧🌧",
        "0": "Умеренный или сильный ливневый дождь 🌧🌧",
        "icon": 356
    },
    {
        "code": 1246,
        "1": "Сильные ливни 🌧🌧🌧",
        "0": "Сильные ливни 🌧🌧🌧",
        "icon": 359
    },
    {
        "code": 1249,
        "1": "Небольшой ливневый дождь со снегом 🌧",
        "0": "Небольшой ливневый дождь со снегом 🌧",
        "icon": 362
    },
    {
        "code": 1252,
        "1": "Умеренные или сильные ливневые дожди со снегом 🌧",
        "0": "Умеренные или сильные ливневые дожди со снегом 🌧",
        "icon": 365
    },
    {
        "code": 1255,
        "1": "Небольшой снег 🌨",
        "0": "Небольшой снег 🌨",
        "icon": 368
    },
    {
        "code": 1258,
        "1": "Умеренный или сильный снег 🌨🌨",
        "0": "Умеренный или сильный снег 🌨🌨",
        "icon": 371
    },
    {
        "code": 1261,
        "1": "Небольшой ледяной дождь 🌧",
        "0": "Небольшой ледяной дождь 🌧",
        "icon": 374
    },
    {
        "code": 1264,
        "1": "Умеренный или сильный ледяной дождь 🌧🌧",
        "0": "Умеренный или сильный ледяной дождь 🌧🌧",
        "icon": 377
    },
    {
        "code": 1273,
        "1": "В отдельных районах местами небольшой дождь с грозой ⛈⛈",
        "0": "В отдельных районах местами небольшой дождь с грозой ⛈⛈",
        "icon": 386
    },
    {
        "code": 1276,
        "1": "В отдельных районах умеренный или сильный дождь с грозой ⛈⛈",
        "0": "В отдельных районах умеренный или сильный дождь с грозой ⛈⛈",
        "icon": 389
    },
    {
        "code": 1279,
        "1": "В отдельных районах местами небольшой снег с грозой 🌨🌩",
        "0": "В отдельных районах местами небольшой снег с грозой 🌨🌩",
        "icon": 392
    },
    {
        "code": 1282,
        "1": "В отдельных районах умеренный или сильный снег с грозой 🌨🌩",
        "0": "В отдельных районах умеренный или сильный снег с грозой 🌨🌩",
        "icon": 395
    }
]




